{
  "architectures": [
    "streetsignsForImageClassification"
  ],
  "downsample_in_first_stage": false,
  "id2label": {
	  "0": "Speed limit (20km/h)",
	  "1": "Speed limit (30km/h)",
	  "2": "Speed limit (50km/h)",
	  "3": "Speed limit (60km/h)",
	  "4": "Speed limit (70km/h)",
	  "5": "Speed limit (80km/h)",
	  "6": "End of speed limit (80km/h)",
	  "7": "Speed limit (100km/h)",
	  "8": "Speed limit (120km/h)",
	  "9": "No passing",
	  "10": "No passing veh over 3.5 tons",
	  "11": "Right-of-way at intersection",
	  "12": "Priority road",
	  "13": "Yield",
	  "14": "Stop",
	  "15": "No Vehicles",
	  "16": "Veh > 3.5 tons prohibited",
	  "17": "No entry",
	  "18": "General caution",
	  "19": "Dangerous curve left",
	  "20": "Dangerous curve right",
	  "21": "Double curve",
	  "22": "Bumpy road",
	  "23": "Slippery road",
	  "24": "Road narrows on the right",
	  "25": "Road work",
	  "26": "Traffic signals",
	  "27": "Pedestrians",
	  "28": "Children crossing",
	  "29": "Bicycles crossing",
	  "30": "Beware of ice/snow",
	  "31": "Wild animals crossing",
	  "32": "End speed + passing limits",
	  "33": "Turn right ahead",
	  "34": "Turn left ahead",
	  "35": "Ahead only",
	  "36": "Go straight or right",
	  "37": "Go straight or left",
	  "38": "Keep right",
	  "39": "Keep left",
	  "40": "Roundabout mandatory",
	  "41": "End of no passing",
	  "42": "End no passing veh > 3.5 tons"
  },
  "label2id": {
	  "Speed limit (20km/h)": "0",
	  "Speed limit (30km/h)": "1",
	  "Speed limit (50km/h)": "2",
	  "Speed limit (60km/h)": "3",
	  "Speed limit (70km/h)": "4",
	  "Speed limit (80km/h)": "5",
	  "End of speed limit (80km/h)": "6",
	  "Speed limit (100km/h)": "7",
	  "Speed limit (120km/h)": "8",
	  "No passing": "9",
	  "No passing veh over 3.5 tons": "10",
	  "Right-of-way at intersection": "11",
	  "Priority road": "12",
	  "Yield": "13",
	  "Stop": "14",
	  "No Vehicles": "15",
	  "Veh > 3.5 tons prohibited": "16",
	  "No entry": "17",
	  "General caution": "18",
	  "Dangerous curve left": "19",
	  "Dangerous curve right": "20",
	  "Double curve": "21",
	  "Bumpy road": "22",
	  "Slippery road": "23",
	  "Road narrows on the right": "24",
	  "Road work": "25",
	  "Traffic signals": "26",
	  "Pedestrians": "27",
	  "Children crossing": "28",
	  "Bicycles crossing": "29",
	  "Beware of ice/snow": "30",
	  "Wild animals crossing": "31",
	  "End speed + passing limits": "32",
	  "Turn right ahead": "33",
	  "Turn left ahead": "34",
	  "Ahead only": "35",
	  "Go straight or right": "36",
	  "Go straight or left": "37",
	  "Keep right": "38",
	  "Keep left": "39",
	  "Roundabout mandatory": "40",
	  "End of no passing": "41",
	  "End no passing veh > 3.5 tons": "42"
	  },
  "model_type": "streetsigns",
  "num_channels": 3,
  "transformers_version": "4.18.0.dev0"
}
	